source/org_posts/2006-12-08-courier-dspam.org
#+TITLE: Courier and dspam
#+AUTHOR: PerlStalker
#+DATE: [2006-12-08 Fri 14:34]
#+begin_html
---
layout: post
title: Courier and dspam
date: 2006-12-08 14:34
comments: true
categories: [courier, dspam]
---
#+end_html
/Originally posted at [2006-12-08 Fri 14:34]/

I currently use SpamAssassin on the mail cluster at work and it works pretty
well. Unfortunately, it doesn't work well enough according to many of our
customers and, more importantly, my boss. So, I worked out this way to use
dspam and SpamAssassin.

"Why use both?" you might ask. The answer is "I don't, really." What I do is
provide dspam as an opt-in service and leave SpamAssassin as the default
filter for those that don't want to be bothered with the reporting that dspam
requires.

Some users don't want to be troubled with reporting spam or false positives or
they really dislike the =!DSPAM= tag that's added to messages filtered with
dspam but they still want some measure of spam filtering. This setup provides
that.

* Needed Ports

  - =databases/mysql41-server= You only need this if you want to use MySQL as
    the storage driver and have the server on the same box.
  - =databases/mysql41-client= You only need this if you want to use MySQL as
    the storage driver.

You might have noticed that mail/dspam is not on that list. That is because,
at this point, the port is not general enough for what I want to do. I suppose
I could change that, but I haven't gotten around to it yet.

* Building dspam

Before you go any farther, be sure you have read [[http://www.nuclearelephant.com/projects/dspam/#documentation][the dspam documentation]].

Download the latest version of dspam from [[http://www.nuclearelephant.com/projects/dspam/#download][the dspam download page]].

: ./configure

*Note:* The complete list of options for configure can seen by running
 =./configure --help=.

Here are the options I used when building dspam. I'll explain them in more
detail below.

#+BEGIN_SRC sh
./configure \
        --bindir=/usr/local/dspam/bin \
        --sbindir=/usr/local/dspam/sbin \
        --with-dspam-group=courier \
        --with-storage-driver=mysql_drv \
        --with-mysql-includes=/usr/local/include/mysql \
        --with-mysql-libraries=/usr/local/lib/mysql \
        --enable-delivery-to-stdout \
        --with-userdir=/var/mail/virtual/dspam \
        --enable-large-scale \
        --enable-alternative-bayesian \
        --enable-spam-delivery \
        --enable-homedir-dotfiles \
        --enable-opt-in \
        --enable-virtual-users \
        --enable-whitelist \
        --enable-source-address-tracking \
        --bindir=/usr/local/dspam/bin \
        --sbindir=/usr/local/dspam/sbin
#        --enable-debug
#        --enable-verbose-debug
#+END_SRC


When I build apps by hand instead of via the ports, I like to put them in a
seperate directory under =/usr/local=. Feel free to leave out =--bindir= and
=--sbindir= to have dspam install itself under =/usr/local/{bin,sbin}=.

: --with-dspam-group=courier

Maildrop runs as group courier. I needed to set this to let the courier group
run dspam.

#+BEGIN_EXAMPLE
        --with-storage-driver=mysql_drv
        --with-mysql-includes=/usr/local/include/mysql
        --with-mysql-libraries=/usr/local/lib/mysql
#+END_EXAMPLE

I'm using MySQL to store account information for dspam. *Note:* The
FreeBSD port puts the MySQL headers and libraries in
=/usr/local/include/mysql= and =/usr/local/lib/mysql=,
respectively. You may need to adjust them for your setup.

#+BEGIN_EXAMPLE
        --enable-delivery-to-stdout
        --enable-spam-delivery
#+END_EXAMPLE

dspam, by default, can do it's own delivery and will quarantine spam when it
finds it. I already quarantine spam with SpamAssassin in each user's Spam
folder, and I want to treat dspam detected spam the same way. So, in order to
allow maildrop to do the quarantine, we need to tell dspam to deliver all
mail, spam or ham, to standard out.

:        --with-userdir=/var/mail/virtual/dspam

This is the directory where dspam will store much of its working information.
This can be where ever you want. I put it on the NFS share for the mail dirs
that I share to the nodes in my mail cluster.

:        --enable-large-scale

This changes how dspam organizes the files in the userdir defined above.

:        --enable-alternative-bayesian

I enabled the alternative baysian to help determine what messages are spam. It
is very important to read the docs before choosing which statistical methods
to use. Choosing the wrong one (or wrong combination) can really screw over
your spam detection if you're not careful.

:        --enable-homedir-dotfiles

I want to allow users to opt-in or opt-out by creating file in their home
directory. At least, that's the idea. This didn't work for me with maildrop
and virtual users. I'm still trying to figure out why. If you know, let me
know and I'll update this page.

:        --enable-opt-in

I require my users to opt-in to dspam because of the delay in catching spam
due to training the filter and because there is no explicit whitelist. Do not
include this if you want dspam on by default.

:        --enable-virtual-users

Turn this on if you are using virtual users.

: --enable-whitelist

My biggest (and its not that big really) complaint about dspam is that it
doesn't have whitelists. This allows for automatic whitelisting of address
under certain conditions.

: --enable-source-address-tracking

I turned this on because, at some point, I want to some analysis of spam
addresses. Feel free to leave this off.

#+BEGIN_EXAMPLE
        --enable-debug
        --enable-verbose-debug
#+END_EXAMPLE

These are useful when for debugging when you are first setting up dspam. You
should not use them in when you deploy in a production environment.

* Build and Install

Run =make && make install= in =build= and install dspam.

When you are testing the global maildrop filter, you may want to build with
=--enable-opt-in= and opt-in your test accounts. This way you can verify that
the whole system works without messing with your users.

** Configuration

dspam has very little post-build configuration, since ost of the configuration
happened at build time.

** trusted.users

This file contains the list of users that can suid when running dspam.

#+BEGIN_EXAMPLE
root
courier
smmsp
daemon
mailnull
#+END_EXAMPLE

** mysql.data

This file contains the information that dspam needs to connect to MySQL. The
format is as follows. See =tools.mysql_drv/README= in the dspam source package
for details.

#+BEGIN_EXAMPLE
HOSTNAME
PORT
USERNAME
PASSWORD
DATABASE
#+END_EXAMPLE

