source/_posts/2006-12-08-courier-dspam.html
---
layout: post
title: Courier and dspam
date: 2006-12-08 14:34
comments: true
categories: [courier, dspam]
---
<p>
<i>Originally posted at <span class="timestamp-wrapper"><span class="timestamp">[2006-12-08 Fri 14:34]</span></span></i>
</p>

<p>
I currently use SpamAssassin on the mail cluster at work and it works pretty
well. Unfortunately, it doesn't work well enough according to many of our
customers and, more importantly, my boss. So, I worked out this way to use
dspam and SpamAssassin.
</p>

<p>
"Why use both?" you might ask. The answer is "I don't, really." What I do is
provide dspam as an opt-in service and leave SpamAssassin as the default
filter for those that don't want to be bothered with the reporting that dspam
requires.
</p>

<p>
Some users don't want to be troubled with reporting spam or false positives or
they really dislike the <code>!DSPAM</code> tag that's added to messages filtered with
dspam but they still want some measure of spam filtering. This setup provides
that.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Needed Ports</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>databases/mysql41-server</code> You only need this if you want to use MySQL as
the storage driver and have the server on the same box.
</li>
<li><code>databases/mysql41-client</code> You only need this if you want to use MySQL as
the storage driver.
</li>
</ul>

<p>
You might have noticed that mail/dspam is not on that list. That is because,
at this point, the port is not general enough for what I want to do. I suppose
I could change that, but I haven't gotten around to it yet.
</p>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Building dspam</h2>
<div class="outline-text-2" id="text-2">
<p>
Before you go any farther, be sure you have read <a href="http://www.nuclearelephant.com/projects/dspam/#documentation">the dspam documentation</a>.
</p>

<p>
Download the latest version of dspam from <a href="http://www.nuclearelephant.com/projects/dspam/#download">the dspam download page</a>.
</p>

<pre class="example">
./configure
</pre>

<p>
<b>Note:</b> The complete list of options for configure can seen by running
 <code>./configure &#x2013;help</code>.
</p>

<p>
Here are the options I used when building dspam. I'll explain them in more
detail below.
</p>

<div class="org-src-container">

<pre class="src src-sh">./configure <span style="color: #ffa07a;">\</span>
        --bindir=/usr/local/dspam/bin <span style="color: #ffa07a;">\</span>
        --sbindir=/usr/local/dspam/sbin <span style="color: #ffa07a;">\</span>
        --with-dspam-group=courier <span style="color: #ffa07a;">\</span>
        --with-storage-driver=mysql_drv <span style="color: #ffa07a;">\</span>
        --with-mysql-includes=/usr/local/include/mysql <span style="color: #ffa07a;">\</span>
        --with-mysql-libraries=/usr/local/lib/mysql <span style="color: #ffa07a;">\</span>
        --enable-delivery-to-stdout <span style="color: #ffa07a;">\</span>
        --with-userdir=/var/mail/virtual/dspam <span style="color: #ffa07a;">\</span>
        --enable-large-scale <span style="color: #ffa07a;">\</span>
        --enable-alternative-bayesian <span style="color: #ffa07a;">\</span>
        --enable-spam-delivery <span style="color: #ffa07a;">\</span>
        --enable-homedir-dotfiles <span style="color: #ffa07a;">\</span>
        --enable-opt-in <span style="color: #ffa07a;">\</span>
        --enable-virtual-users <span style="color: #ffa07a;">\</span>
        --enable-whitelist <span style="color: #ffa07a;">\</span>
        --enable-source-address-tracking <span style="color: #ffa07a;">\</span>
        --bindir=/usr/local/dspam/bin <span style="color: #ffa07a;">\</span>
        --sbindir=/usr/local/dspam/sbin
<span style="color: #ff7f24;">#        </span><span style="color: #ff7f24;">--enable-debug</span>
<span style="color: #ff7f24;">#        </span><span style="color: #ff7f24;">--enable-verbose-debug</span>
</pre>
</div>


<p>
When I build apps by hand instead of via the ports, I like to put them in a
seperate directory under <code>/usr/local</code>. Feel free to leave out <code>&#x2013;bindir</code> and
<code>&#x2013;sbindir</code> to have dspam install itself under <code>/usr/local/{bin,sbin}</code>.
</p>

<pre class="example">
--with-dspam-group=courier
</pre>

<p>
Maildrop runs as group courier. I needed to set this to let the courier group
run dspam.
</p>

<pre class="example">
--with-storage-driver=mysql_drv
--with-mysql-includes=/usr/local/include/mysql
--with-mysql-libraries=/usr/local/lib/mysql
</pre>

<p>
I'm using MySQL to store account information for dspam. <b>Note:</b> The
FreeBSD port puts the MySQL headers and libraries in
<code>/usr/local/include/mysql</code> and <code>/usr/local/lib/mysql</code>,
respectively. You may need to adjust them for your setup.
</p>

<pre class="example">
--enable-delivery-to-stdout
--enable-spam-delivery
</pre>

<p>
dspam, by default, can do it's own delivery and will quarantine spam when it
finds it. I already quarantine spam with SpamAssassin in each user's Spam
folder, and I want to treat dspam detected spam the same way. So, in order to
allow maildrop to do the quarantine, we need to tell dspam to deliver all
mail, spam or ham, to standard out.
</p>

<pre class="example">
--with-userdir=/var/mail/virtual/dspam
</pre>

<p>
This is the directory where dspam will store much of its working information.
This can be where ever you want. I put it on the NFS share for the mail dirs
that I share to the nodes in my mail cluster.
</p>

<pre class="example">
--enable-large-scale
</pre>

<p>
This changes how dspam organizes the files in the userdir defined above.
</p>

<pre class="example">
--enable-alternative-bayesian
</pre>

<p>
I enabled the alternative baysian to help determine what messages are spam. It
is very important to read the docs before choosing which statistical methods
to use. Choosing the wrong one (or wrong combination) can really screw over
your spam detection if you're not careful.
</p>

<pre class="example">
--enable-homedir-dotfiles
</pre>

<p>
I want to allow users to opt-in or opt-out by creating file in their home
directory. At least, that's the idea. This didn't work for me with maildrop
and virtual users. I'm still trying to figure out why. If you know, let me
know and I'll update this page.
</p>

<pre class="example">
--enable-opt-in
</pre>

<p>
I require my users to opt-in to dspam because of the delay in catching spam
due to training the filter and because there is no explicit whitelist. Do not
include this if you want dspam on by default.
</p>

<pre class="example">
--enable-virtual-users
</pre>

<p>
Turn this on if you are using virtual users.
</p>

<pre class="example">
--enable-whitelist
</pre>

<p>
My biggest (and its not that big really) complaint about dspam is that it
doesn't have whitelists. This allows for automatic whitelisting of address
under certain conditions.
</p>

<pre class="example">
--enable-source-address-tracking
</pre>

<p>
I turned this on because, at some point, I want to some analysis of spam
addresses. Feel free to leave this off.
</p>

<pre class="example">
--enable-debug
--enable-verbose-debug
</pre>

<p>
These are useful when for debugging when you are first setting up dspam. You
should not use them in when you deploy in a production environment.
</p>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Build and Install</h2>
<div class="outline-text-2" id="text-3">
<p>
Run <code>make &amp;&amp; make install</code> in <code>build</code> and install dspam.
</p>

<p>
When you are testing the global maildrop filter, you may want to build with
<code>&#x2013;enable-opt-in</code> and opt-in your test accounts. This way you can verify that
the whole system works without messing with your users.
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Configuration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
dspam has very little post-build configuration, since ost of the configuration
happened at build time.
</p>
</div>
</div>
<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> trusted.users</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This file contains the list of users that can suid when running dspam.
</p>

<pre class="example">
root
courier
smmsp
daemon
mailnull
</pre>
</div>
</div>
<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> mysql.data</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This file contains the information that dspam needs to connect to MySQL. The
format is as follows. See <code>tools.mysql_drv/README</code> in the dspam source package
for details.
</p>

<pre class="example">
HOSTNAME
PORT
USERNAME
PASSWORD
DATABASE
</pre>
</div>
</div>
</div>
