source/org_posts/2006-12-08-courier-dspam.org
* Setup MySQL

The dspam package comes with SQL files that you can use to setup MySQL
in =tools.mysql_drv/=. You should take this opportunity to read the
=README= file in that directory.

dspam now ships with two mysql_ojects files optimized for spam and speed. I
use the speed optimized file but modify it to use INNODB tables instead of
MyISAM tables.

#+BEGIN_SRC sh
cd tools.mysql_drv/
mysql -u root -p DATABASE < mysql_objects.sql
mysql -u root -p DATABASE < virtual_users.sql
#+END_SRC

*Note:* The last command is only required if you are using virtual users.

If dspam is going to use a different username than to access the dspam_*
tables, you will need to create the user and give it access to those tables
with the grant command.

* Testing dspam

See section 1.2 of the README for testing instructions.

* maildroprc

dspam is all set, now it's time to add it to maildroprc. Below, is a sample
maildroprc.

#+BEGIN_EXAMPLE
import SENDER
import HOME

if ($SENDER ne "")
{
         FROM=$SENDER
}
else
{
         FROM="unknown"
}

CLEAN_FROM=escape($FROM);
# Spam Filter
xfilter "/usr/local/dspam/bin/dspam --user $LOGNAME"

if (/^X-DSPAM-Result:/:h)
{
}
else
{
         xfilter "/usr/local/bin/spamc -u $LOGNAME"
}

if (/^X-Spam-Status: Yes/:h || /^X-DSPAM-Result: Spam/:h)
{
         # See if the Spam folder exists.
         `test -d "./Maildir/.Spam/"`
         if ($RETURNCODE != 0)
         {
                 # If not, copy one from the pre-existing skel directory.
                 `cp -Rp /usr/local/etc/courier/skel/Maildir/.Spam ./Maildir/`
         }
         to "./Maildir/.Spam/."
}
#+END_EXAMPLE

*Note:* For some reason my system is having problems with nots. Hence,
the jacked-up if-else in that file. I would expect a simple =if (!
/^X-DSPAM-Result:/:h)= to work, but it doesn't.

The observant reader will notice that if dspam runs (and adds it's
=X-DSPAM-Result= header), spamc doesn't run. This is intentional. I originally
had =if (/^X-DSPAM-Result: Innocent/:h)= which would run spamc if dspam didn't
think the message was spam. I found, that once dspam was trained, spamc never
found different spam.

It also caused problems with the training process for dspam. Let me explain
with an example. Suppose a new dspam user gets a message that dspam thinks is
innocent but SpamAssassin sees as spam. The message gets tagged as spam with
the X-Spam-Status: Yes header and maildrop happily moves the message to the
Spam folder. Our user is happy because the message is caught and ignores the
message (or deletes it). What our user doesn't know, is that dspam didn't
catch the message and so scores it as innocent. That will raise the
probability that similar messages are are treated as innocent, thus making
dspam less effective. (The whole reason for putting dspam in place was that is
was more effective than SpamAssassin.)

I set it up this way for another reason, too. As I stated earlier, my users
have to opt-in to dspam. This setup provides spam filtering through
SpamAssassin for those users that choose not to use dspam. It also you to
still use SpamAssassin as a default scanner if your users choose to opt-out of
an on-by-default dspam setup.

* Aliases

Each dspam user will need aliases setup to report spam and false positives to.
I use =.courier= files in the user's home directory.

**  $HOME/.courier-spam

Users report spam by sending it to a special alias on their account created by
adding -spam to the user name portion of their address. E.g. user@domain would
send to user-spam@domain.

: |/usr/local/dspam/bin/dspam --user user@domain --addspam

** $HOME/.courier-fp

In the case of false positives, users report it by sending it to a another
alias on their account created by adding -fp to the user name portion of their
address. E.g. user@domain would send to user-fp@domain.

: |/usr/local/dspam/bin/dspam --user user@domain --falsepositive

The suffixes can, of course, be changed by changing the name of the .courier
file.

It should be possible to setup a global aliases instead of aliases in users'
home directories. Simply create =/usr/local/etc/courier/aliasdir/.courier-spam=
with the following (untested) line.

: |/usr/local/dspam/bin/dspam --user $LOCAL@$HOST --addspam

Or you can create a spam user in each domain you host with a .courier-default
that looks like the following.

: |/usr/local/dspam/bin/dspam --user $EXT@$HOST --addspam

The false positive alias would be similar.

*Note:* Don't forget to run =makealiases= if you update the global alias file.

* Testing Courier, maildrop and dspam

The nicest way I found to test this setup was to build dspam with
=--enable-opt-in= and then opt-in my test accounts. This way you can test your
production setup without screwing up mail delivery for the rest of your users.
When you're satisfied that everything is working properly, you can then
rebuild dspam without =--enable-opt-in= and you're good to go.

