source/_posts/2006-12-08-courier-dspam.html
<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Setup MySQL</h2>
<div class="outline-text-2" id="text-4">
<p>
The dspam package comes with SQL files that you can use to setup MySQL
in <code>tools.mysql_drv/</code>. You should take this opportunity to read the
<code>README</code> file in that directory.
</p>

<p>
dspam now ships with two mysql_ojects files optimized for spam and speed. I
use the speed optimized file but modify it to use INNODB tables instead of
MyISAM tables.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> tools.mysql_drv/
mysql -u root -p DATABASE &lt; mysql_objects.sql
mysql -u root -p DATABASE &lt; virtual_users.sql
</pre>
</div>

<p>
<b>Note:</b> The last command is only required if you are using virtual users.
</p>

<p>
If dspam is going to use a different username than to access the dspam_*
tables, you will need to create the user and give it access to those tables
with the grant command.
</p>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Testing dspam</h2>
<div class="outline-text-2" id="text-5">
<p>
See section 1.2 of the README for testing instructions.
</p>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> maildroprc</h2>
<div class="outline-text-2" id="text-6">
<p>
dspam is all set, now it's time to add it to maildroprc. Below, is a sample
maildroprc.
</p>

<pre class="example">
import SENDER
import HOME

if ($SENDER ne "")
{
         FROM=$SENDER
}
else
{
         FROM="unknown"
}

CLEAN_FROM=escape($FROM);
# Spam Filter
xfilter "/usr/local/dspam/bin/dspam --user $LOGNAME"

if (/^X-DSPAM-Result:/:h)
{
}
else
{
         xfilter "/usr/local/bin/spamc -u $LOGNAME"
}

if (/^X-Spam-Status: Yes/:h || /^X-DSPAM-Result: Spam/:h)
{
         # See if the Spam folder exists.
         `test -d "./Maildir/.Spam/"`
         if ($RETURNCODE != 0)
         {
                 # If not, copy one from the pre-existing skel directory.
                 `cp -Rp /usr/local/etc/courier/skel/Maildir/.Spam ./Maildir/`
         }
         to "./Maildir/.Spam/."
}
</pre>

<p>
<b>Note:</b> For some reason my system is having problems with nots. Hence,
the jacked-up if-else in that file. I would expect a simple <code>if (!
/^X-DSPAM-Result:/:h)</code> to work, but it doesn't.
</p>

<p>
The observant reader will notice that if dspam runs (and adds it's
<code>X-DSPAM-Result</code> header), spamc doesn't run. This is intentional. I originally
had <code>if (/^X-DSPAM-Result: Innocent/:h)</code> which would run spamc if dspam didn't
think the message was spam. I found, that once dspam was trained, spamc never
found different spam.
</p>

<p>
It also caused problems with the training process for dspam. Let me explain
with an example. Suppose a new dspam user gets a message that dspam thinks is
innocent but SpamAssassin sees as spam. The message gets tagged as spam with
the X-Spam-Status: Yes header and maildrop happily moves the message to the
Spam folder. Our user is happy because the message is caught and ignores the
message (or deletes it). What our user doesn't know, is that dspam didn't
catch the message and so scores it as innocent. That will raise the
probability that similar messages are are treated as innocent, thus making
dspam less effective. (The whole reason for putting dspam in place was that is
was more effective than SpamAssassin.)
</p>

<p>
I set it up this way for another reason, too. As I stated earlier, my users
have to opt-in to dspam. This setup provides spam filtering through
SpamAssassin for those users that choose not to use dspam. It also you to
still use SpamAssassin as a default scanner if your users choose to opt-out of
an on-by-default dspam setup.
</p>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Aliases</h2>
<div class="outline-text-2" id="text-7">
<p>
Each dspam user will need aliases setup to report spam and false positives to.
I use <code>.courier</code> files in the user's home directory.
</p>
</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> $HOME/.courier-spam</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Users report spam by sending it to a special alias on their account created by
adding -spam to the user name portion of their address. E.g. user@domain would
send to user-spam@domain.
</p>

<pre class="example">
|/usr/local/dspam/bin/dspam --user user@domain --addspam
</pre>
</div>
</div>
<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> $HOME/.courier-fp</h3>
<div class="outline-text-3" id="text-7-2">
<p>
In the case of false positives, users report it by sending it to a another
alias on their account created by adding -fp to the user name portion of their
address. E.g. user@domain would send to user-fp@domain.
</p>

<pre class="example">
|/usr/local/dspam/bin/dspam --user user@domain --falsepositive
</pre>

<p>
The suffixes can, of course, be changed by changing the name of the .courier
file.
</p>

<p>
It should be possible to setup a global aliases instead of aliases in users'
home directories. Simply create <code>/usr/local/etc/courier/aliasdir/.courier-spam</code>
with the following (untested) line.
</p>

<pre class="example">
|/usr/local/dspam/bin/dspam --user $LOCAL@$HOST --addspam
</pre>

<p>
Or you can create a spam user in each domain you host with a .courier-default
that looks like the following.
</p>

<pre class="example">
|/usr/local/dspam/bin/dspam --user $EXT@$HOST --addspam
</pre>

<p>
The false positive alias would be similar.
</p>

<p>
<b>Note:</b> Don't forget to run <code>makealiases</code> if you update the global alias file.
</p>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Testing Courier, maildrop and dspam</h2>
<div class="outline-text-2" id="text-8">
<p>
The nicest way I found to test this setup was to build dspam with
<code>&#x2013;enable-opt-in</code> and then opt-in my test accounts. This way you can test your
production setup without screwing up mail delivery for the rest of your users.
When you're satisfied that everything is working properly, you can then
rebuild dspam without <code>&#x2013;enable-opt-in</code> and you're good to go.
</p>
</div>
</div>
