source/org_posts/2006-12-08-courier-dspam.org
* dspam Maintenance

dspam comes with a couple of tools to keep your database clean: =dspam_clean=
and =tools.mysql_drv/purge.sql=. These tools are dscribed in the dspam
documentation and should be set to run periodically as described in those
docs.

I modified =purge.sql= to elimitate some locking issues I was having and, in the
process, made it 3 times faster. Basically, I combined the three deletes on
=dspam_token_data= into one.

#+BEGIN_SRC sql
set @a=to_days(current_date());

lock table dspam_token_data write;
delete from dspam_token_data
   where
    ((innocent_hits*2) + spam_hits < 5 and @a-to_days(last_hit) > 15)
    or (innocent_hits = 1 and @a-to_days(last_hit) > 7)
    or (@a-to_days(last_hit) > 20)
   ;
unlock table;

lock table dspam_signature_data write;
delete from dspam_signature_data
   where @a-to_days(created_on) > 14;
unlock tables;
#+END_SRC

Well, the locking issues went away (because I was locking the tables) but I
had more problems. The delete was taking so long to run that the system kept
maxing out the maximum number of connections. To fix this, I wrote a perl
script that deletes tokens and signatures 100 at a time and sleeps for a
couple of seconds between deletes. That gives enough time for other things to
happen between deletes. (You can see the SQL from above on lines 21-26 and
30-32.)

#+BEGIN_SRC perl -n
#!/usr/local/bin/perl
use warnings;
use strict;

use DBI;

my $db_name = 'Accounts';
my $db_host = 'localhost';
my $db_user = 'root';
my $db_pass = 'secret';

my $dbh = DBI->connect("DBI:mysql:".$db_name.':'.$db_host,
        $db_user,
        $db_pass);

my $now = 'to_days(current_date())';

my @sql = ();

push @sql, <<"TOKEN";
delete LOW_PRIORITY from dspam_token_data
where
   ((innocent_hits*2) + spam_hits < 5 and $now-to_days(last_hit) > 15)
   or (innocent_hits = 1 and $now-to_days(last_hit) > 7)
   or ($now-to_days(last_hit) > 20)
limit 100
TOKEN
    ;
push @sql, << "SIG";
delete LOW_PRIORITY from dspam_signature_data
where $now-to_days(created_on) > 14
limit 100
SIG
    ;

#print join "\n", @sql;

foreach my $sql (@sql) {
    my $tot = 0;
    while (my $rv = $dbh->do($sql)) {
if ($rv <= -1) {
    warn $dbh->errstr, "\n";
    last;
} elsif ($rv == 0) {
    last;
}
#print $tot += $rv;
sleep 2;
    }
    #print "\n";
}
#+END_SRC

One thing you might have noticed is that I have removed the locks. Part of the
reason is that I moved to INNODB tables which do row-level locking so it's not
as much of a problem. Another part is that I changed the deletes to be low
priority so that they don't interfere with the normal mail flow. (See lines 21
and 30.) Finally, if the script fails to acquire a lock, it simply tries
again. (I occasionally see a failed lock or two on the dspam_signature_data
table but I haven't figured out how to make those go away. As I said, it's not
a problem but it doesn't feel "clean.")

If you want to spend the time, you can add an order by last_hit clause to the
SQL commands so that the oldest tokens and signatures are deleted first. I
didn't feel the need to spend CPU and memory on it though.

