source/_posts/2006-12-08-courier-dspam.html
<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> dspam Maintenance</h2>
<div class="outline-text-2" id="text-9">
<p>
dspam comes with a couple of tools to keep your database clean: <code>dspam_clean</code>
and <code>tools.mysql_drv/purge.sql</code>. These tools are dscribed in the dspam
documentation and should be set to run periodically as described in those
docs.
</p>

<p>
I modified <code>purge.sql</code> to elimitate some locking issues I was having and, in the
process, made it 3 times faster. Basically, I combined the three deletes on
<code>dspam_token_data</code> into one.
</p>

<div class="org-src-container">

<pre class="src src-sql">set @a=to_days(current_date());

lock table dspam_token_data write;
delete from dspam_token_data
   where
    ((innocent_hits*2) + spam_hits &lt; 5 and @a-to_days(last_hit) &gt; 15)
    or (innocent_hits = 1 and @a-to_days(last_hit) &gt; 7)
    or (@a-to_days(last_hit) &gt; 20)
   ;
unlock table;

lock table dspam_signature_data write;
delete from dspam_signature_data
   where @a-to_days(created_on) &gt; 14;
unlock tables;
</pre>
</div>

<p>
Well, the locking issues went away (because I was locking the tables) but I
had more problems. The delete was taking so long to run that the system kept
maxing out the maximum number of connections. To fix this, I wrote a perl
script that deletes tokens and signatures 100 at a time and sleeps for a
couple of seconds between deletes. That gives enough time for other things to
happen between deletes. (You can see the SQL from above on lines 21-26 and
30-32.)
</p>

<div class="org-src-container">

<pre class="src src-perl"><span class="linenr"> 1: </span><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/usr/local/bin/perl</span>
<span class="linenr"> 2: </span><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">warnings</span>;
<span class="linenr"> 3: </span><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">strict</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">DBI</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">db_name</span> = <span style="color: #ffa07a;">'Accounts'</span>;
<span class="linenr"> 8: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">db_host</span> = <span style="color: #ffa07a;">'localhost'</span>;
<span class="linenr"> 9: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">db_user</span> = <span style="color: #ffa07a;">'root'</span>;
<span class="linenr">10: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">db_pass</span> = <span style="color: #ffa07a;">'secret'</span>;
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">dbh</span> = DBI-&gt;connect(<span style="color: #ffa07a;">"DBI:mysql:"</span>.$<span style="color: #eedd82;">db_name</span>.<span style="color: #ffa07a;">':'</span>.$<span style="color: #eedd82;">db_host</span>,
<span class="linenr">13: </span>        $<span style="color: #eedd82;">db_user</span>,
<span class="linenr">14: </span>        $<span style="color: #eedd82;">db_pass</span>);
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">now</span> = <span style="color: #ffa07a;">'to_days(current_date())'</span>;
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #98fb98;">my</span> @<span style="color: #eedd82; text-decoration: underline;">sql</span> = ();
<span class="linenr">19: </span>
<span class="linenr">20: </span>push @<span style="color: #eedd82; text-decoration: underline;">sql</span>, &lt;&lt;<span style="color: #ffa07a;">"TOKEN"</span>;
<span class="linenr">21: </span>delete LOW_PRIORITY from dspam_token_data
<span class="linenr">22: </span>where
<span class="linenr">23: </span>   ((innocent_hits*<span style="color: #eedd82;">2</span>) + spam_hits &lt; 5 and $<span style="color: #eedd82;">now</span>-to_days(last_hit) &gt; 15)
<span class="linenr">24: </span>   or (innocent_hits = 1 and $<span style="color: #eedd82;">now</span>-to_days(last_hit) &gt; 7)
<span class="linenr">25: </span>   or ($<span style="color: #eedd82;">now</span>-to_days(last_hit) &gt; 20)
<span class="linenr">26: </span>limit 100
<span class="linenr">27: </span>TOKEN
<span class="linenr">28: </span>    ;
<span class="linenr">29: </span>push @<span style="color: #eedd82; text-decoration: underline;">sql</span>, &lt;&lt; <span style="color: #ffa07a;">"SIG"</span>;
<span class="linenr">30: </span>delete LOW_PRIORITY from dspam_signature_data
<span class="linenr">31: </span>where $<span style="color: #eedd82;">now</span>-to_days(created_on) &gt; 14
<span class="linenr">32: </span>limit 100
<span class="linenr">33: </span>SIG
<span class="linenr">34: </span>    ;
<span class="linenr">35: </span>
<span class="linenr">36: </span><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">print join "\n", @sql;</span>
<span class="linenr">37: </span>
<span class="linenr">38: </span><span style="color: #00ffff;">foreach</span> <span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">sql</span> (@<span style="color: #eedd82; text-decoration: underline;">sql</span>) {
<span class="linenr">39: </span>    <span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">tot</span> = 0;
<span class="linenr">40: </span>    <span style="color: #00ffff;">while</span> (<span style="color: #98fb98;">my</span> $<span style="color: #eedd82;">rv</span> = $<span style="color: #eedd82;">dbh</span>-&gt;<span style="color: #00ffff;">do</span>($<span style="color: #eedd82;">sql</span>)) {
<span class="linenr">41: </span><span style="color: #00ffff;">if</span> ($<span style="color: #eedd82;">rv</span> &lt;= -1) {
<span class="linenr">42: </span>    warn $<span style="color: #eedd82;">dbh</span>-&gt;errstr, <span style="color: #ffa07a;">"\n"</span>;
<span class="linenr">43: </span>    <span style="color: #00ffff;">last</span>;
<span class="linenr">44: </span>} <span style="color: #00ffff;">elsif</span> ($<span style="color: #eedd82;">rv</span> == 0) {
<span class="linenr">45: </span>    <span style="color: #00ffff;">last</span>;
<span class="linenr">46: </span>}
<span class="linenr">47: </span><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">print $tot += $rv;</span>
<span class="linenr">48: </span>sleep 2;
<span class="linenr">49: </span>    }
<span class="linenr">50: </span>    <span style="color: #ff7f24;">#print "\n";</span>
<span class="linenr">51: </span>}
</pre>
</div>

<p>
One thing you might have noticed is that I have removed the locks. Part of the
reason is that I moved to INNODB tables which do row-level locking so it's not
as much of a problem. Another part is that I changed the deletes to be low
priority so that they don't interfere with the normal mail flow. (See lines 21
and 30.) Finally, if the script fails to acquire a lock, it simply tries
again. (I occasionally see a failed lock or two on the dspam_signature_data
table but I haven't figured out how to make those go away. As I said, it's not
a problem but it doesn't feel "clean.")
</p>

<p>
If you want to spend the time, you can add an order by last_hit clause to the
SQL commands so that the oldest tokens and signatures are deleted first. I
didn't feel the need to spend CPU and memory on it though.
</p>
</div>
</div>
